EDT/УТ/src/Documents/ОтклонениеЗаказа_КУдалению/ОтклонениеЗаказа_КУдалению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтклонениеЗаказа_КУдалению</name>
  <registerRecords>AccumulationRegister.ЗакрытыеЗаказы</registerRecords>
  <registerRecords>InformationRegister.СтатусыСкладскогоУчета</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклоненияЗаказаВСистеме</name>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусAxiomus</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СтатусыСкладскогоУчета/СтатусыСкладскогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыСкладскогоУчета</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусСкладскогоУчета</name>
    <type>
      <types>CatalogRef.СтатусыСкладскогоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/AccumulationRegisters/ЗакрытыеЗаказы/ЗакрытыеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗакрытыеЗаказы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаОценочная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПолученная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиДоМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиЗаМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БанковскаяКомиссия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КассовоеОбслуживание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Масса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЧастичногоВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОплаченоКлиентовНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АгентскоеВознаграждение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаПоКредиту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСДЧистые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтраховойСбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактическийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабораПоЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгруженныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьОценочнаяПоТоварно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПодъемаМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоТарифицируемыхРейсов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВознаграждениеАгентаПоПредоплаченнымЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФрахтЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Поступление</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Списание</name>
    <type>
      <types>DocumentRef.СписаниеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Оприходование</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещение</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВозврата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
      <types>CatalogRef.КатегорииДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусЗаказа</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаНевыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусИнтернетМагазина</name>
    <type>
      <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>VIPДоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидVip</name>
    <type>
      <types>CatalogRef.ВидыVip</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТипыТарифов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйБрейк</name>
    <type>
      <types>CatalogRef.РасчетныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСеткаПартнера</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаТарификации</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтклоненияЗаказа</name>
    <comment>Причина отклонения заказа в системе</comment>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалПриёма</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъемныйБрейк</name>
    <type>
      <types>CatalogRef.ОбъемныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодъемныйБрейк</name>
    <type>
      <types>CatalogRef.ВесовыеБрейкиРасчетаСтоимостиПодъемов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Catalogs/СтатусыСкладскогоУчета/СтатусыСкладскогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыСкладскогоУчета</name>
  <predefined>
    <items>
      <name>Возврат1</name>
      <description>Возврат 1</description>
    </items>
    <items>
      <name>Возврат2</name>
      <description>Возврат 2</description>
    </items>
    <items>
      <name>ВозвратОтправлен</name>
      <description>Возврат отправлен</description>
    </items>
    <items>
      <name>ВозвратПринятМагазином</name>
      <description>Возврат принят магазином</description>
    </items>
    <items>
      <name>ЗаказВернулсяСРегионаНаТерминалПриемки</name>
      <description>Заказ вернулся с региона на терминал приемки</description>
    </items>
    <items>
      <name>ЗаказВыполнен</name>
      <description>Заказ выполнен</description>
    </items>
    <items>
      <name>ЗаказНеВозвратный</name>
      <description>Заказ не возвратный</description>
    </items>
    <items>
      <name>ОтменаСтатуса</name>
      <description>Отмена статуса</description>
    </items>
    <items>
      <name>ПодготовленКВозврату</name>
      <description>Подготовлен к возврату</description>
    </items>
    <items>
      <name>ПриходЕстьНаСканере</name>
      <description>Приход есть на сканере</description>
    </items>
    <items>
      <name>ПриходПодтвержден</name>
      <description>Приход подтвержден</description>
    </items>
    <items>
      <name>ПриходПодтвержденПриходнымДокументом</name>
      <description>Приход подтвержден приходным документом</description>
    </items>
    <items>
      <name>ПриходПроверен</name>
      <description>Приход проверен</description>
    </items>
    <items>
      <name>УчтеноРасхождение</name>
      <description>Учтено расхождение</description>
    </items>
  </predefined>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>CatalogRef.СтатусыЗаказов</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Documents/ОтклонениеЗаказа_КУдалению/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Соединение = Евген.СоздатьПодключениеКИнтернетМагазину();
	
	//1. Выставлять статусинтернетмагазина на реализации = 4
	РеализацияОбъект = Заказ.ПолучитьОбъект();
	РеализацияОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	РеализацияОбъект.СтатусИнтернетМагазина = 4;
	
	
	//2. Помечать док на удаление		
	РеализацияОбъект.ПометкаУдаления = Истина;
	РеализацияОбъект.ОбменДанными.Загрузка = Истина;
	РеализацияОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	
	//3. Делать записи в РН Закрытые заказы по подобию документа Закрытие
	ЗакрытыеЗаказы();
	
	
	//4. Делать записи в РС СтатусыСкладскогоУчета по подобию загрузки отклоненного заказа в обработке ЗагрузкаИзИнтернетМагазина
	Движения.СтатусыСкладскогоУчета.Записывать = Истина;
	
	Если smv.ЗаказПодтвержденПриходом(Заказ, ТекущаяДата(), Справочники.СтатусыСкладскогоУчета.ПриходПроверен) И smv.НебылоВозврата(Заказ) Тогда		
		Движение = Движения.СтатусыСкладскогоУчета.Добавить();
		Движение.Заказ = Заказ;
		Движение.Период = Дата;
		Движение.Регистратор = ЭтотОбъект.Ссылка;    
		Движение.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка;
		
		Если СтатусAxiomus = 81 Тогда  // предотмена			
			Движение.СтатусСкладскогоУчета = Справочники.СтатусыСкладскогоУчета.Возврат1;	
		ИначеЕсли СтатусAxiomus = 120 Тогда  // полный отказ
		    Движение.СтатусСкладскогоУчета = Справочники.СтатусыСкладскогоУчета.Возврат2;
		КонецЕсли;		
   	КонецЕсли;
	
		
	
	//5. Обновлять статус заказа в админке, опять же, по подобию документа ЗакрытиеЗаказов
	
	//ЗаписьЖурналаРегистрации("Отмена заказа", УровеньЖурналаРегистрации.Информация, Метаданные.Документы.РеализацияТоваровУслуг, Заказ, ""+БылСтатус+" -> 4");
	
	Комм = Лев(СокрЛП(Заказ.КомментарийСД), 100);	
	ReasonRefusalID = ?(ЗначениеЗаполнено(ПричинаОтклоненияЗаказаВСистеме.Код), Прав(ПричинаОтклоненияЗаказаВСистеме.Код,1), 0);
    orderID = СокрЛП(Заказ.Номер);
    who = ПараметрыСеанса.ТекущийПользователь;
    completeDate = Евген.ДатаВSQL(Заказ.Дата, Ложь);
	//serviceDC = Формат(Стр.Показатель1 + Стр.Показатель2 + Стр.Показатель3 + Стр.Показатель4 + Стр.Показатель5 + Стр.Показатель6, "ЧРД=.; ЧН=0; ЧГ=");
	//serviceDCclean = Формат(Стр.УслугиСДЧистые, "ЧРД=.; ЧН=0; ЧГ=");	
	serviceDC = Формат(0, "ЧРД=.; ЧН=0; ЧГ=");
	serviceDCclean = Формат(0, "ЧРД=.; ЧН=0; ЧГ=");	
    comment = СтрЗаменить(Комм, "'", """");
    isRefusal = 0;
	//ReasonRefusal = ?(Стр.ПричинаОтказа.Пустая(), "", СокрЛП(Стр.ПричинаОтказа.Наименование));
	ReasonRefusal = "";
    deliveryPrice = "NULL";
    payType  = "NULL";
							
	// Отключено в рамках Задача № 2586						
	//ТекстЗапроса = "
	//|DECLARE @t TSetOrderStatus
	//|INSERT INTO @t ([orderID],[statusId],[who],[completeDate],serviceDC,serviceDCclean,comment, isRefusal, ReasonRefusal, deliveryPrice, payType, ReasonRefusalID) VALUES (" +
	//orderID +", 4, '" +who+"', '"+completeDate+"', "+serviceDC+"," +serviceDCclean+",'" +comment+"', "+isRefusal+ ", '" +ReasonRefusal+"'," +deliveryPrice+ "," +payType+","+ReasonRefusalID+")
	//|EXEC import_setOrderStatusFrom1C @t
	//|";
	//Евген.ЗапросКИнтернетМагазину(ТекстЗапроса, Соединение);
	
	// Задача № 2586
	
	closeFlag = ?(РежимПроведения = РежимЗаписиДокумента.Проведение, 1, 0);
	
	mas.ОтправитьФинальныйСтатусВАдминку(orderID, 4, comment,
	who,
	Заказ.Дата,
	serviceDC,
	serviceDCclean,
	IsRefusal,
	,
	,
	,
	ReasonRefusalID,
	,
	closeFlag,
	Заказ.ТерминалДоставки.Код);
	// Задача № 2586
	
	
КонецПроцедуры

// Движение по РН ЗакрытыеЗаказы
Процедура ЗакрытыеЗаказы()

	Движения.ЗакрытыеЗаказы.БлокироватьДляИзменения = Истина;
    Движения.ЗакрытыеЗаказы.Записать();	
	
		
	Нов = Движения.ЗакрытыеЗаказы.Добавить();
	                    
	Нов.ПричинаОтклоненияЗаказа = ПричинаОтклоненияЗаказаВСистеме;
	Нов.Период = Заказ.Дата;
	
	//Нов.БанковскаяКомиссия = ;
	//Нов.СтраховойСбор      = ;                
	//Нов.ПричинаОтклоненияЗаказа = ;
	//Нов.Возврат = ;
	//Нов.Доставка = ;
	Нов.ИнтернетМагазин = Заказ.ВладелецТовара;
	//Нов.КассовоеОбслуживание = ;	
	Нов.Клиент = Заказ.Контрагент;
	//Нов.Оприходование = ;
	//Нов.Перемещение = ;
	//Нов.УслугиСДЧистые =;
	//Нов.Поступление = ;
	//Нов.ПричинаНевыполнения = ;
	Нов.Реализация = Заказ;
	//Нов.Списание = ;
	//Нов.СтатусЗаказа = ;
	//Нов.VIPДоставка = ;
	Нов.ПредоплатаПоКредиту = Заказ.ПредоплатаПоКредиту;
	Нов.ЗонаТарификации = Заказ.ЗонаТарификации;		
	Нов.ТерминалДоставки = Заказ.ТерминалДоставки;
	Нов.ТерминалПриёма = Заказ.ТерминалПриема;
	//Нов.ФактическийВес = Заказ.ФактическийВес;
	Нов.СтатусИнтернетМагазина = Справочники.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен;	
	//Нов.СуммаДоставкиДоМКАД = ;
	//Нов.СуммаДоставкиЗаМКАД = ;
		
	//ОбновитьОтказСЗаездомПоЗаказуВАдминке(СокрЛП(Тек.Реализация.Номер));
	
	Нов.СуммаОценочная = Заказ.Товары.Итог("Сумма");
	Нов.СуммаПолученная = Заказ.Товары.Итог("Сумма");
	Нов.КатегорияДоставки = Заказ.КатегорияДоставки;

	//Нов.ТипОплаты = Заказ.ТипОплаты;
	Нов.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка;
	//Нов.УслугиСД = ;
	//Нов.Масса = ;
	//Нов.Экспедитор = ;
	//Нов.Водитель = ;
	//Нов.АгентскоеВознаграждение = Заказ.АгентскоеВознаграждение;
	//Нов.Транспорт = ;
	//Нов.ПризнакВозврата = ;	
	//Нов.ЮрЛицо = ;	
	//Нов.ТарифнаяСетка = Заказ.ТарифнаяСетка;
	//Нов.ТарифнаяСеткаПартнера = Заказ.ТарифнаяСеткаПартнера;
	//Нов.РасчетныйБрейк = Заказ.РасчетныйБрейк;				
	//Нов.ОценочнаяСтоимость = ;
	
	Если ЗначениеЗаполнено(Заказ.ВладелецТовара) Тогда 
		Если Не Заказ.ВладелецТовара.Родитель.ОсновнойМагазин.Пустая() Тогда
			Нов.Партнер = Заказ.ВладелецТовара.Родитель.ОсновнойМагазин;
		Иначе
			Нов.Партнер = Заказ.ВладелецТовара;
		КонецеСли;
	КонецЕсли;	
	
    Движения.ЗакрытыеЗаказы.БлокироватьДляИзменения = Истина;
    Движения.ЗакрытыеЗаказы.Записать();

КонецПроцедуры
